import { IBlitz } from "../../domains/IBlitz";

const blitz: Record<number, string[]> = {
  1: ["бокс", "дед мороз", "вид искусства", "часть судна", "вид мотоцикла суп"],
  2: [
    "хобби",
    "сувенир",
    "Исландия",
    "марка телефона",
    'слово заканчивающееся на "-лин"',
    "киносага",
  ],
  3: [
    "кубок",
    "порода собак",
    "промежуток времени",
    "чистящее средство",
    "земля",
    "банк",
  ],
  4: [
    "Мексика",
    "конозлодей",
    "хищник",
    "иностранный универ",
    "бутерброд",
    "теория...",
  ],
  5: [
    "Испания",
    "метательное оружее",
    "киностудия",
    "культурное растение",
    "начинка для пиццы",
    "муза",
  ],
  6: [
    "экстренная служба",
    "природное явление",
    "мост",
    "хищная птица",
    'рифма к слову "Дуб"',
    "Европейская столица",
  ],

  7: [
    "известная Елена",
    "фехтование",
    "пустыня",
    "чудо света",
    "тарантино",
    "пещерный человек",
  ],
  8: [
    "Турция",
    "печенье",
    "промышленность",
    "марка фотоаппарата",
    "болезнь",
    "шампунь",
  ],
  9: [
    "сахар",
    "Германия",
    "популярная профессия",
    "водный вид спорта",
    "герой анекдота",
    "ящерица",
  ],
  10: [
    "механизм",
    "цирковая профессия",
    "рогатое животное",
    "крупная иностранная компания",
    "телевикторина",
    "титул",
  ],
};

export const BLITZ: IBlitz[] = Object.entries(blitz).map(([id, words]) => ({
  id: id.toString(),
  words,
  type: "blitz",
}));
